In [1]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.<br>
Ans. df.info(),df.describe(),df["col1"].max(), df.loc(), df[df["col1"]>10]

In [2]:
df = pd.DataFrame({"Name":['Alice','Bob','Claire'],"Age":[25,30,27],"Gender":['Female','Male','Femae']})
print(df.info())
print(df.describe())

print("max Age",df.Age.max())
print(df.loc[1:2,["Name","Age"]])
df[df["Age"]>26]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes
None
             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000
max Age 30
     Name  Age
1     Bob   30
2  Claire   27

     Name  Age Gender
1     Bob   30   Male
2  Claire   27  Femae

<hr>Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [3]:
df = pd.DataFrame(data= [(100,200,300),(10,20,30),(1,2,3)], columns = ["A","B","C"])

def reindex_dataframe(df):
    new_index = pd.RangeIndex(start=1, stop=2 * len(df), step=2)
    df_reindexed = df.copy()
    df_reindexed.index = new_index
    return df_reindexed


dff = reindex_dataframe(df)
dff

     A    B    C
1  100  200  300
3   10   20   30
5    1    2    3

<hr>Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [4]:
df = pd.DataFrame({"Values":[10, 20, 30, 40, 50]})

df[0:3].apply(lambda x:x.sum(),axis = 0)

Values    60
dtype: int64

<hr> Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [5]:
df3 = pd.DataFrame({"Desc" :["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language." , "my name is sudh" ,"i use to teach data science "] })

df3["Word_Count"] = df3["Desc"].apply(lambda x: len(x.split()))
df3

                                                Desc  Word_Count
0  Data Science Masters course is highly curated ...         104
1                                    my name is sudh           4
2                       i use to teach data science            6

<hr>Q5. How are DataFrame.size() and DataFrame.shape() different?<br>
Ans. df.size(),Returns size of dataframe/series which is equivalent to total number of elements.<br>
df.shape(), Returns tuple of shape (Rows, columns) of dataframe/series.<hr>

Q6. Which function of pandas do we use to read an excel file?<br>
Ans. df.read_excel('data.xlsx')<hr>

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.<br>

In [6]:
df = pd.DataFrame({"Email":['harshjalan0602@gmail.com','dikujalan@gmail.com','dheeraj.jalan@gmail.com','jitesh@yahoo.com']})
df["User_Name"] = df["Email"].apply(lambda x: (x.split("@"))[0])
df

                      Email       User_Name
0  harshjalan0602@gmail.com  harshjalan0602
1       dikujalan@gmail.com       dikujalan
2   dheeraj.jalan@gmail.com   dheeraj.jalan
3          jitesh@yahoo.com          jitesh

<hr>Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [7]:
df = pd.DataFrame({ "A":(3,8,6,2,9),"B":(5,2,9,3,1),"C":(1,7,4,5,2)})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [8]:
dff = df[(df["A"]>5) &(df["B"]<10)]
dff

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

<hr>Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [9]:
df = pd.DataFrame({"Values":[10, 20, 30, 40, 50]})
print(df["Values"].mean())
print(df["Values"].median())
print(df["Values"].std())
print(df["Values"].sum())

30.0
30.0
15.811388300841896
150

<hr>Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [10]:
date = pd.date_range("2023-01-01","2023-01-15")
df4 = pd.DataFrame({"date":date,"sales":[10,8,15,17,14,16,13,8,7,8,0.65,14,16,11,9]})
df4["moving_average"] =   df4["sales"].rolling( window = 7).mean()
df4

         date  sales  moving_average
0  2023-01-01  10.00             NaN
1  2023-01-02   8.00             NaN
2  2023-01-03  15.00             NaN
3  2023-01-04  17.00             NaN
4  2023-01-05  14.00             NaN
5  2023-01-06  16.00             NaN
6  2023-01-07  13.00       13.285714
7  2023-01-08   8.00       13.000000
8  2023-01-09   7.00       12.857143
9  2023-01-10   8.00       11.857143
10 2023-01-11   0.65        9.521429
11 2023-01-12  14.00        9.521429
12 2023-01-13  16.00        9.521429
13 2023-01-14  11.00        9.235714
14 2023-01-15   9.00        9.378571

<hr>Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain.

In [11]:
date = pd.date_range("2023-01-01","2023-01-15")
# df.date = pd.to_datetime(df.date)
df4 = pd.DataFrame({"date":date})
df4["week_day"] = df4["date"].dt.day_name()
df4

         date   week_day
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday
5  2023-01-06     Friday
6  2023-01-07   Saturday
7  2023-01-08     Sunday
8  2023-01-09     Monday
9  2023-01-10    Tuesday
10 2023-01-11  Wednesday
11 2023-01-12   Thursday
12 2023-01-13     Friday
13 2023-01-14   Saturday
14 2023-01-15     Sunday

<hr>Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [12]:
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-15','2023-02-06', '2023-01-25', '2023-02-05']})
df.Date = pd.to_datetime(df.Date)

df[df.Date.between('2023-01-01','2023-01-31')]

        Date
0 2023-01-01
1 2023-01-15
3 2023-01-25

<hr>Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?<br>
Ans. As Pandas is dependent on the NumPy library, we need to import this dependency.